/*
2.1 整型

作用：整型变量表示的是 整数类型 的数据
C++中能够表示整型的类型有以下几种方式， 区别在于所占内存空间不同：

| **数据类型**        | **占用空间**                                    | 取值范围         |
| ------------------- | ----------------------------------------------- | ---------------- |
| short(短整型)       | 2字节                                           | (-2^15 ~ 2^15-1) |
| int(整型)           | 4字节                                           | (-2^31 ~ 2^31-1) |
| long(长整形)        | Windows为4字节，Linux为4字节(32位)，8字节(64位)     | (-2^31 ~ 2^31-1) |
| long long(长长整形) | 8字节                                            | (-2^63 ~ 2^63-1) |
*/